Revit 2027 API
EnergyDataSettings.ExportCategory Property
 Value is a category indicating which discipline model will be used for GreenBuildingXML export. This property only applies if AnalysisType is RoomsOrSpaces.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ExportCategory { get; set; }
Public Property ExportCategory As ElementId
	Get
	Set
public:
property ElementId^ ExportCategory {
	ElementId^ get ();
	void set (ElementId^ value);
}
member ExportCategory : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The export category is neither OST_Rooms nor OST_MEPSpaces.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 OST_Rooms will use the architectural 3d rooms for export. OST_MEPSpaces will use the MEP 3d Spaces for export.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace